performance/reports/archive/runs/normal-day-2026-08-18T02-10-50/summary.txt
     ✓ login 200
     ✓ board list 200
     ✓ post detail 200
     ✓ hot daily 200
     ✓ post list 200
     ✓ post reaction 2xx
     ✓ comment list 200
     ✓ post search 200
     ✓ post create 2xx
     ✓ unread count 200
     ✓ notif list 200
     ✓ scrap 2xx
     ✓ read all 200
     ✓ chat rooms 200
     ✓ chat messages 200
     ✓ comment reaction 200
     ✓ chat read 200
     ✓ refresh 200
     ✓ read one 200
     ✓ user info 200
     ✓ my posts 200
     ✓ post update 200
     ✓ post delete 200
     ✓ ws handshake 101
     ✓ meal today 200
     ✓ timetable today 200
     ✓ comment create 2xx
     ✓ meal month 200
     ✓ friend list 200
     ✓ received reqs 200
     ✓ logout 200

     auth_token_refreshes...........: 74      0.044953/s
     chat_ws_messages_sent..........: 1815    1.102556/s
     chat_ws_rtt....................: avg=4.8s    min=16ms    med=4.09s    max=22.48s   p(90)=9.48s    p(95)=11.43s   p(99)=15.23s  
     checks.........................: 100.00% ✓ 28806     ✗ 0    
     ✓ { phase:measure }............: 100.00% ✓ 22262     ✗ 0    
     ✓ { phase:rampdown }...........: 100.00% ✓ 2018      ✗ 0    
     ✓ { phase:warmup }.............: 100.00% ✓ 4526      ✗ 0    
     data_received..................: 1.3 GB  790 kB/s
     data_sent......................: 12 MB   7.1 kB/s
     http_req_blocked...............: avg=16.67µs min=1.59µs  med=6.68µs   max=1.93ms   p(90)=17.36µs  p(95)=21.69µs  p(99)=279.57µs
     http_req_connecting............: avg=5.18µs  min=0s      med=0s       max=1.61ms   p(90)=0s       p(95)=0s       p(99)=188.81µs
     http_req_duration..............: avg=7.68s   min=2.29ms  med=7.23s    max=36.28s   p(90)=13.93s   p(95)=16.03s   p(99)=21.66s  
       { expected_response:true }...: avg=7.68s   min=2.29ms  med=7.23s    max=36.28s   p(90)=13.93s   p(95)=16.03s   p(99)=21.66s  
     ✓ { feature:auth }.............: avg=4.46s   min=13.9ms  med=3.45s    max=19.37s   p(90)=10.05s   p(95)=11.65s   p(99)=15.89s  
     ✓ { feature:board }............: avg=7.68s   min=2.48ms  med=7.42s    max=23.47s   p(90)=13.66s   p(95)=15.15s   p(99)=18.39s  
     ✓ { feature:chat }.............: avg=7.86s   min=3.48ms  med=7.64s    max=23.96s   p(90)=13.74s   p(95)=15.58s   p(99)=18.19s  
     ✓ { feature:comment }..........: avg=9.37s   min=2.29ms  med=8.3s     max=36.28s   p(90)=17.73s   p(95)=21.49s   p(99)=27.3s   
     ✓ { feature:friend }...........: avg=7.85s   min=3.64ms  med=7.38s    max=20.09s   p(90)=13.61s   p(95)=15.99s   p(99)=17.92s  
     ✓ { feature:hot }..............: avg=7.47s   min=10.04ms med=7.25s    max=24.76s   p(90)=13.24s   p(95)=14.86s   p(99)=17.92s  
     ✓ { feature:mypage }...........: avg=7.73s   min=3.47ms  med=7.33s    max=19.17s   p(90)=13.62s   p(95)=15.39s   p(99)=17.24s  
     ✓ { feature:notification }.....: avg=7.68s   min=3.27ms  med=7.39s    max=25.76s   p(90)=13.6s    p(95)=15.52s   p(99)=19.18s  
     ✓ { feature:post }.............: avg=7.07s   min=2.62ms  med=6.81s    max=26.81s   p(90)=13.07s   p(95)=14.73s   p(99)=17.53s  
     ✓ { feature:reaction }.........: avg=7.39s   min=17.73ms med=7.17s    max=19.98s   p(90)=13.26s   p(95)=14.56s   p(99)=17.59s  
     ✓ { feature:school }...........: avg=8.3s    min=3.36ms  med=7.59s    max=23.21s   p(90)=14.68s   p(95)=16.55s   p(99)=20.34s  
     ✓ { feature:scrap }............: avg=7.93s   min=17.18ms med=7.65s    max=20.13s   p(90)=13.97s   p(95)=14.79s   p(99)=16.99s  
     ✓ { feature:timetable }........: avg=7.9s    min=2.58ms  med=7.95s    max=20.11s   p(90)=13.91s   p(95)=14.81s   p(99)=17s     
     ✓ { op:auth }..................: avg=4.46s   min=13.9ms  med=3.45s    max=19.37s   p(90)=10.05s   p(95)=11.65s   p(99)=15.89s  
     ✗ { op:read,phase:measure }....: avg=8.49s   min=3.2ms   med=7.96s    max=36.28s   p(90)=14.28s   p(95)=16.31s   p(99)=21.82s  
     ✗ { op:write,phase:measure }...: avg=8.95s   min=17.43ms med=8.41s    max=26.46s   p(90)=14.92s   p(95)=16.63s   p(99)=20.3s   
     ✓ { page:0 }...................: avg=5.05s   min=2.88ms  med=4.35s    max=20.22s   p(90)=9.98s    p(95)=12.3s    p(99)=14.58s  
     ✓ { page:1 }...................: avg=4.96s   min=3.42ms  med=4.36s    max=19.52s   p(90)=9.5s     p(95)=10.77s   p(99)=15.31s  
     ✓ { page:2 }...................: avg=5.57s   min=3.32ms  med=4.66s    max=20.27s   p(90)=11.45s   p(95)=12.94s   p(99)=14.64s  
     ✓ { page:3 }...................: avg=5.21s   min=3.63ms  med=4.61s    max=18.73s   p(90)=9.43s    p(95)=12.53s   p(99)=17.29s  
     ✓ { page:4 }...................: avg=5.14s   min=2.62ms  med=4.27s    max=16.06s   p(90)=11.15s   p(95)=13.27s   p(99)=15.41s  
     ✓ { phase:measure }............: avg=8.52s   min=3.2ms   med=7.98s    max=36.28s   p(90)=14.33s   p(95)=16.34s   p(99)=21.7s   
     ✓ { phase:rampdown }...........: avg=5.72s   min=2.29ms  med=5.5s     max=26.98s   p(90)=10.12s   p(95)=11.1s    p(99)=17.13s  
     ✓ { phase:warmup }.............: avg=4.49s   min=2.52ms  med=2.98s    max=31.98s   p(90)=12.25s   p(95)=14.8s    p(99)=22.29s  
     http_req_failed................: 0.00%   ✓ 0         ✗ 28491
     ✓ { phase:measure }............: 0.00%   ✓ 0         ✗ 22002
     ✓ { phase:rampdown }...........: 0.00%   ✓ 0         ✗ 1839 
     ✓ { phase:warmup }.............: 0.00%   ✓ 0         ✗ 4650 
     http_req_receiving.............: avg=1.98ms  min=16.32µs med=258.29µs max=421.45ms p(90)=1.3ms    p(95)=3.18ms   p(99)=69.57ms 
     http_req_sending...............: avg=59.95µs min=5.45µs  med=39.17µs  max=980.86µs p(90)=125.86µs p(95)=173.63µs p(99)=257.45µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=7.68s   min=2.17ms  med=7.23s    max=36.21s   p(90)=13.92s   p(95)=16.03s   p(99)=21.6s   
     http_reqs......................: 28491   17.307394/s
     ✓ { feature:auth }.............: 384     0.233268/s
     ✓ { feature:board }............: 2677    1.626194/s
     ✓ { feature:chat }.............: 2095    1.272647/s
     ✓ { feature:comment }..........: 5169    3.140006/s
     ✓ { feature:friend }...........: 471     0.286118/s
     ✓ { feature:hot }..............: 2677    1.626194/s
     ✓ { feature:mypage }...........: 390     0.236913/s
     ✓ { feature:notification }.....: 1170    0.710739/s
     ✓ { feature:post }.............: 12315   7.480979/s
     ✓ { feature:reaction }.........: 533     0.323781/s
     ✓ { feature:school }...........: 262     0.159157/s
     ✓ { feature:scrap }............: 138     0.083831/s
     ✓ { feature:timetable }........: 210     0.127568/s
     ✓ { op:auth }..................: 384     0.233268/s
     ✓ { op:read }..................: 26018   15.805124/s
     ✓ { op:write }.................: 2089    1.269002/s
     ✓ { page:0 }...................: 1492    0.906343/s
     ✓ { page:1 }...................: 506     0.307379/s
     ✓ { page:2 }...................: 323     0.196212/s
     ✓ { page:3 }...................: 232     0.140933/s
     ✓ { page:4 }...................: 124     0.075326/s
     ✓ { phase:measure }............: 22002   13.365529/s
     ✓ { phase:rampdown }...........: 1839    1.117135/s
     ✓ { phase:warmup }.............: 4650    2.82473/s
     iteration_duration.............: avg=43s     min=1.08s   med=32.09s   max=2m38s    p(90)=1m31s    p(95)=1m42s    p(99)=2m2s    
     iterations.....................: 6583    3.998967/s
     ✓ { phase:measure }............: 0       0/s
     ✓ { phase:rampdown }...........: 0       0/s
     ✓ { phase:warmup }.............: 0       0/s
     phase_iterations...............: 6583    3.998967/s
     ✓ { phase:measure }............: 5182    3.147903/s
     ✓ { phase:rampdown }...........: 486     0.29523/s
     ✓ { phase:warmup }.............: 915     0.555834/s
     vus............................: 1       min=0       max=200
     vus_max........................: 200     min=200     max=200
     ws_connecting..................: avg=6.48s   min=3.05ms  med=5.98s    max=25.09s   p(90)=12.71s   p(95)=14.61s   p(99)=16.8s   
     ws_msgs_received...............: 1644    0.998679/s
     ws_msgs_sent...................: 2447    1.486476/s
     ws_session_duration............: avg=29.1s   min=16.26s  med=28.47s   max=49.32s   p(90)=38.29s   p(95)=41.11s   p(99)=45.17s  
     ws_sessions....................: 316     0.19196/s